# coding=utf-8
import redis


# 查看redis版本信息
# def get_redis_info():
#     r = redis.StrictRedis(host='172.16.104.185', port=6379, db=0)
#     print(r.info())

# 线上master
def get_set_info():
    r = redis.StrictRedis(host='10.5.111.125', port=6379, db=0)
    # print(r.exists("crm_strategy_task_zset"))
    # s = r.zscan("crm_strategy_task_zset", 20)
    # print(s)
    # print(r.hgetall("crm_group_910_b_2020-12-28"))
    mm = r.hgetall("crm_group_910_a_2020-12-28")
    for m in mm:
        print(str(m))
    # print(r.hset("crm_1_a_2020-03-27", "43784202", "0"))


if __name__ == '__main__':
    r = redis.StrictRedis(host='10.5.111.125', port=6379, db=0)

    ll = [202111162465233593, 202111162465233605, 202111162465233683, 202111162465233693, 202111162465233713,
          202111162465233723, 202111162465233733, 202111162465233743, 202111162465233753, 202111162465233763,
          202111162465233773, 202111162465233783, 202111162465233793, 202111162465233853, 202111162465233863,
          202111162465233873, 202111162465233895, 202111162465233903, 202111162465233913, 202111162465233924,
          202111162465233975, 202111162465234023, 202111162465234113, 202111162465234133, 202111162465234143,
          202111162465234184, 202111162465234254, 202111162465234273, 202111162465234295, 202111162465234303,
          202111162465234313, 202111162465234323, 202111162465234333, 202111162465234353, 202111162465234383,
          202111162465234403, 202111162465234413, 202111162465234433, 202111162465234443, 202111162465234453,
          202111162465234463, 202111162465234493, 202111162465234544]
    # for m in wx_list:
    #     print(m, r.hget("yao_xin_groupon_v3_dst_mobile_115", m))
    #     # print(m, r.hdel("yao_xin_groupon_v3_dst_mobile_115", m))
    # for m in m_list:
    #     print(m, r.hget("yao_xin_groupon_v3_open_id_115", m))
    #     # print(m, r.hdel("yao_xin_groupon_v3_open_id_115", m))
    for s in ll:
        print(str(s), r.get("order_add_gift_tmp_" + str(s)))
